"""Задача 4. Есть ли статистически значимые различия в среднем росте матерей и
дочерей?
Рост матерей 172, 177, 158, 170, 178,175, 164, 160, 169, 165
Рост взрослых дочерей: 173, 175, 162, 174, 175, 168, 155, 170, 160, 163
"""

import numpy as np
from scipy import stats

# H0: mu1 = mu2, H1: mu1 != mu2

mothers = np.array([172, 177, 158, 170, 178, 175, 164, 160, 169, 165])
daughters = np.array([173, 175, 162, 174, 175, 168, 155, 170, 160, 163])
alpha = 0.05

t = stats.ttest_rel(mothers, daughters)
print(t)

# Т.к. pvalue > alpha, Н0 не отвергается на уровне значимости 0.05
